---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ProhibitSwitchToIssuedRevision
source: html/83e707a0-aa09-9348-393f-3ec385587327.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevisionCloudFailures.ProhibitSwitchToIssuedRevision Property

Can't add cloud to an Issued Revision.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProhibitSwitchToIssuedRevision { get; }
```